import { Participant } from '@common/declation/participant';

class TempParticipant {}

export const data354 = {
    name: '제354기 독도아카데미',
    startDate: new Date('2023-04-12'),
    endDate: new Date('2023-04-14'),
    groups: [
        {
            number: '1',
            manager: '이미옥',
            contact: '010-4188-9375',
            participants: [
                [
                    '1',
                    '부천초등학교',
                    '박희준',
                    '1964.8.12',
                    '01087539313',
                    '남',
                    '1',
                    '우산국투어',
                    '이사부호텔',
                    '207',
                ],
                [
                    '2',
                    '배곧라온초등학교',
                    '이찬희',
                    '1964.5.10',
                    '01035902653',
                    '남',
                    '1',
                    '우산국투어',
                    '이사부호텔',
                    '207',
                ],
                [
                    '3',
                    '석천중학교',
                    '오금연',
                    '1963.4.28',
                    '01084367032',
                    '여',
                    '1',
                    '우산국투어',
                    '이사부호텔',
                    '505',
                ],
                [
                    '4',
                    '호곡중학교',
                    '이민자',
                    '1963.1.11',
                    '01045998412',
                    '여',
                    '1',
                    '우산국투어',
                    '이사부호텔',
                    '505',
                ],
                [
                    '5',
                    '경기국제통상고등학교',
                    '함숙규',
                    '1961.4.25',
                    '01027191746',
                    '여',
                    '1',
                    '우산국투어',
                    '이사부호텔',
                    '506',
                ],
                [
                    '6',
                    '부천부흥초등학교',
                    '황기남',
                    '1961.10.17',
                    '01037272077',
                    '여',
                    '1',
                    '우산국투어',
                    '이사부호텔',
                    '506',
                ],
                [
                    '7',
                    '옥길중학교',
                    '김미화',
                    '1961.6.18',
                    '01045218645',
                    '여',
                    '1',
                    '우산국투어',
                    '이사부호텔',
                    '606',
                ],
                [
                    '8',
                    '일동고등학교',
                    '이미경',
                    '1963.9.25',
                    '01087721904',
                    '여',
                    '1',
                    '우산국투어',
                    '이사부호텔',
                    '606',
                ],
                [
                    '9',
                    '고양동산고등학교',
                    '전병웅',
                    '1962.10.5',
                    '01027105611',
                    '남',
                    '1',
                    '우산국투어',
                    '에이스호텔',
                    '203',
                ],
                [
                    '10',
                    '서정고등학교',
                    '피봉호',
                    '1962.10.25',
                    '01052022734',
                    '남',
                    '1',
                    '우산국투어',
                    '에이스호텔',
                    '203',
                ],
                [
                    '11',
                    '신원중학교',
                    '정연희',
                    '1962.9.30',
                    '01033037631',
                    '여',
                    '1',
                    '우산국투어',
                    '에이스호텔',
                    '205',
                ],
                [
                    '12',
                    '김포한가람중학교',
                    '박경희',
                    '1962.7.10',
                    '01063041230',
                    '여',
                    '1',
                    '우산국투어',
                    '에이스호텔',
                    '205',
                ],
                [
                    '13',
                    '덕이고등학교',
                    '이문성',
                    '1962.3.16',
                    '01043145065',
                    '남',
                    '1',
                    '우산국투어',
                    '에이스호텔',
                    '206',
                ],
                [
                    '14',
                    '양주도담학교',
                    '유우랑아랑',
                    '1973.10.15',
                    '01088322227',
                    '남',
                    '1',
                    '우산국투어',
                    '에이스호텔',
                    '206',
                ],
                [
                    '15',
                    '구리남양주교육지원청',
                    '성승호',
                    '1976.10.22',
                    '01032561950',
                    '남',
                    '1',
                    '우산국투어',
                    '에이스호텔',
                    '305',
                ],
                [
                    '16',
                    '효자고등학교',
                    '전용준',
                    '1971.5.27',
                    '01062535726',
                    '남',
                    '1',
                    '우산국투어',
                    '에이스호텔',
                    '305',
                ],
                [
                    '17',
                    '양오중학교',
                    '한의석',
                    '1972.2.24',
                    '01030541088',
                    '남',
                    '1',
                    '우산국투어',
                    '에이스호텔',
                    '306',
                ],
                [
                    '18',
                    '구리고등학교',
                    '김학수',
                    '1973.8.2',
                    '01033098412',
                    '남',
                    '1',
                    '우산국투어',
                    '에이스호텔',
                    '306',
                ],
                [
                    '19',
                    '수주고등학교',
                    '김중한',
                    '1963.5.11',
                    '01022411649',
                    '남',
                    '1',
                    '우산국투어',
                    '선창호텔',
                    '202',
                ],
                [
                    '20',
                    '은여울중학교',
                    '심재성',
                    '1961.6.1',
                    '01087855268',
                    '남',
                    '1',
                    '우산국투어',
                    '선창호텔',
                    '202',
                ],
                [
                    '21',
                    '양도중학교',
                    '선원희',
                    '1963.7.24',
                    '01021713640',
                    '여',
                    '1',
                    '우산국투어',
                    '선창호텔',
                    '203',
                ],
                [
                    '22',
                    '김포신곡중학교',
                    '장순희',
                    '1961.4.10',
                    '01088604827',
                    '여',
                    '1',
                    '우산국투어',
                    '선창호텔',
                    '203',
                ],
                [
                    '23',
                    '김포여자중학교',
                    '이혜경',
                    '1962.3.13',
                    '01047196513',
                    '여',
                    '1',
                    '우산국투어',
                    '선창호텔',
                    '205',
                ],
                [
                    '24',
                    '금파중학교',
                    '황정애',
                    '1961.11.17',
                    '01033291374',
                    '여',
                    '1',
                    '우산국투어',
                    '선창호텔',
                    '205',
                ],
                [
                    '25',
                    '김포고등학교',
                    '정해용',
                    '1964.6.25',
                    '01097797215',
                    '남',
                    '1',
                    '우산국투어',
                    '선창호텔',
                    '302',
                ],
                [
                    '26',
                    '김포고등학교',
                    '강영길',
                    '1961.9.1',
                    '01089256949',
                    '남',
                    '1',
                    '우산국투어',
                    '선창호텔',
                    '302',
                ],
                [
                    '27',
                    '수주중학교',
                    '이영해',
                    '1964.2.20',
                    '01050959808',
                    '여',
                    '1',
                    '우산국투어',
                    '선창호텔',
                    '303',
                ],
                [
                    '28',
                    '김포제일고등학교',
                    '정선주',
                    '1965.8.15',
                    '01092397567',
                    '여',
                    '1',
                    '우산국투어',
                    '선창호텔',
                    '303',
                ],
                [
                    '29',
                    '고림고등학교',
                    '강선대',
                    '1961.11.3',
                    '01037953157',
                    '남',
                    '1',
                    '우산국투어',
                    '선창호텔',
                    '305',
                ],
                [
                    '30',
                    '효자중학교',
                    '김광배',
                    '1961.11.12',
                    '01035342045',
                    '남',
                    '1',
                    '우산국투어',
                    '선창호텔',
                    '305',
                ],
                [
                    '31',
                    '화성시',
                    '차선주',
                    '1966.6.11',
                    '01033680282',
                    '남',
                    '1',
                    '우산국투어',
                    '선창호텔',
                    '306',
                ],
                [
                    '32',
                    '장기고등학교',
                    '강범석',
                    '1961.3.25',
                    '01077087056',
                    '남',
                    '1',
                    '우산국투어',
                    '선창호텔',
                    '306',
                ],
            ],
            restaurants: [
                {
                    name: '울릉도식당',
                    menu: '엉겅퀴 해장국',
                    price: 10000,
                },
            ],
        },
    ],
};

class Group {
    name: string;
    participants: Participant[];
    bus: Bus;
    reservation: Reservation;

    constructor(
        name: string,
        participants: Participant[],
        bus: Bus,
        reservation: Reservation,
    ) {
        this.name = name;
        this.participants = participants;
        this.bus = bus;
        this.reservation = reservation;
    }
}

interface Bus {
    name: string;
    company: string;
    number: number;
    driverName: string;
    driverContact: string;
    plateNumber: string;
}

interface Reservation {
    restaurants: Restaurant[];
    hotels: Hotel[];
}

interface Restaurant {
    name: string;
    address: string;
    contact: string;
    menu: string;
    time: string;
    pricePerPerson: number;
    totalPrice: number;
}

interface Hotel {
    name: string;
    address: string;
    contact: string;
    roomNumber: string;
    participants: Participant[];
}

//[["1","부천초등학교","박희준","1964.8.12","01087539313","남","1","우산국투어","이사부호텔","207"],["2","배곧라온초등학교","이찬희","1964.5.10","01035902653","남","1","우산국투어","이사부호텔","207"],["3","석천중학교","오금연","1963.4.28","01084367032","여","1","우산국투어","이사부호텔","505"],["4","호곡중학교","이민자","1963.1.11","01045998412","여","1","우산국투어","이사부호텔","505"],["5","경기국제통상고등학교","함숙규","1961.4.25","01027191746","여","1","우산국투어","이사부호텔","506"],["6","부천부흥초등학교","황기남","1961.10.17","01037272077","여","1","우산국투어","이사부호텔","506"],["7","옥길중학교","김미화","1961.6.18","01045218645","여","1","우산국투어","이사부호텔","606"],["8","일동고등학교","이미경","1963.9.25","01087721904","여","1","우산국투어","이사부호텔","606"],["9","고양동산고등학교","전병웅","1962.10.5","01027105611","남","1","우산국투어","에이스호텔","203"],["10","서정고등학교","피봉호","1962.10.25","01052022734","남","1","우산국투어","에이스호텔","203"],["11","신원중학교","정연희","1962.9.30","01033037631","여","1","우산국투어","에이스호텔","205"],["12","김포한가람중학교","박경희","1962.7.10","01063041230","여","1","우산국투어","에이스호텔","205"],["13","덕이고등학교","이문성","1962.3.16","01043145065","남","1","우산국투어","에이스호텔","206"],["14","양주도담학교","유우랑아랑","1973.10.15","01088322227","남","1","우산국투어","에이스호텔","206"],["15","구리남양주교육지원청","성승호","1976.10.22","01032561950","남","1","우산국투어","에이스호텔","305"],["16","효자고등학교","전용준","1971.5.27","01062535726","남","1","우산국투어","에이스호텔","305"],["17","양오중학교","한의석","1972.2.24","01030541088","남","1","우산국투어","에이스호텔","306"],["18","구리고등학교","김학수","1973.8.2","01033098412","남","1","우산국투어","에이스호텔","306"],["19","수주고등학교","김중한","1963.5.11","01022411649","남","1","우산국투어","선창호텔","202"],["20","은여울중학교","심재성","1961.6.1","01087855268","남","1","우산국투어","선창호텔","202"],["21","양도중학교","선원희","1963.7.24","01021713640","여","1","우산국투어","선창호텔","203"],["22","김포신곡중학교","장순희","1961.4.10","01088604827","여","1","우산국투어","선창호텔","203"],["23","김포여자중학교","이혜경","1962.3.13","01047196513","여","1","우산국투어","선창호텔","205"],["24","금파중학교","황정애","1961.11.17","01033291374","여","1","우산국투어","선창호텔","205"],["25","김포고등학교","정해용","1964.6.25","01097797215","남","1","우산국투어","선창호텔","302"],["26","김포고등학교","강영길","1961.9.1","01089256949","남","1","우산국투어","선창호텔","302"],["27","수주중학교","이영해","1964.2.20","01050959808","여","1","우산국투어","선창호텔","303"],["28","김포제일고등학교","정선주","1965.8.15","01092397567","여","1","우산국투어","선창호텔","303"],["29","고림고등학교","강선대","1961.11.3","01037953157","남","1","우산국투어","선창호텔","305"],["30","효자중학교","김광배","1961.11.12","01035342045","남","1","우산국투어","선창호텔","305"],["31","화성시","차선주","1966.6.11","01033680282","남","1","우산국투어","선창호텔","306"],["32","장기고등학교","강범석","1961.3.25","01077087056","남","1","우산국투어","선창호텔","306"]]
